app/Controllers/admin/AyamHidup.php

    public function index()
    {
        $data['title'] = 'Data Ayam Hidup';
        $data['data_ayam'] = $this->ayamHidupModel->orderBy('tanggal_masuk', 'DESC')->findAll();
---
SELECT *
FROM `ayam_hidup`
ORDER BY `tanggal_masuk` DESC