app/Controllers/admin/HasilProduksi.php

   public function index()
{
    $data['hasil_produksi'] = $this->hasilProduksiModel
        ->select('hasil_produksi.*, ayam_hidup.tanggal_masuk, produk.nama_produk')
        ->join('ayam_hidup', 'ayam_hidup.id = hasil_produksi.ayam_hidup_id')
        ->join('produk', 'produk.id = hasil_produksi.produk_id')
        ->orderBy('tanggal_produksi', 'DESC')
        ->findAll();
---
SELECT `hasil_produksi`.*, `ayam_hidup`.`tanggal_masuk`, `produk`.`nama_produk`
FROM `hasil_produksi`
JOIN `ayam_hidup` ON `ayam_hidup`.`id` = `hasil_produksi`.`ayam_hidup_id`
JOIN `produk` ON `produk`.`id` = `hasil_produksi`.`produk_id`
ORDER BY `tanggal_produksi` DESC

public function create()
{
    // Contoh ambil data ayam hidup dan produk untuk pilihan di form
    $data['ayam_hidup'] = $this->ayamHidupModel->where('status', 'tersedia')->findAll();
    $data['produk'] = $this->produkModel->where('status', 'aktif')->findAll();
---
SELECT *
FROM `ayam_hidup`
WHERE `status` = 'tersedia'
SELECT *
FROM `produk`
WHERE `status` = 'aktif'