app/Controllers/admin/TransaksiController.php

    public function index()
    {
        $data = [
            'title'     => 'Data Transaksi',
            'transaksi' => $this->transaksiModel
                ->orderBy('tanggal_transaksi', 'DESC')
                ->findAll()
---
SELECT *
FROM `transaksi`
ORDER BY `tanggal_transaksi` DESC