app/Controllers/Dashboard.php

    public function admin()
    {
        $db = \Config\Database::connect();

        $ayamHidup = $db->table('ayam_hidup')
            ->selectSum('jumlah_ekor')
            ->where('status', 'tersedia')
            ->where('tanggal_keluar IS NULL', null, false)
            ->get()
            ->getRow()
            ->jumlah_ekor ?? 0;

        $produksiHariIni = $db->table('hasil_produksi')
            ->selectSum('jumlah_kg')
            ->where('tanggal_produksi', date('Y-m-d'))
            ->get()
            ->getRow()
            ->jumlah_kg ?? 0;

        $stokMasuk  = $db->table('hasil_produksi')->selectSum('jumlah_kg')->get()->getRow()->jumlah_kg ?? 0;
        $stokKeluar = $db->table('detail_transaksi')->selectSum('jumlah_kg')->get()->getRow()->jumlah_kg ?? 0;
        $totalStokProduk = max(0, $stokMasuk - $stokKeluar);

        $calonMitra = $db->table('users')->where('role', 'calon_mitra')->countAllResults();
        $totalMitra = $db->table('users')->where('role', 'mitra')->countAllResults();
---
SELECT SUM(`jumlah_ekor`) AS `jumlah_ekor`
FROM `ayam_hidup`
WHERE `status` = 'tersedia'
AND tanggal_keluar IS NULL
SELECT SUM(`jumlah_kg`) AS `jumlah_kg`
FROM `hasil_produksi`
WHERE `tanggal_produksi` = '2025-08-06'
SELECT SUM(`jumlah_kg`) AS `jumlah_kg`
FROM `hasil_produksi`
SELECT SUM(`jumlah_kg`) AS `jumlah_kg`
FROM `hasil_produksi`
WHERE `tanggal_produksi` = '2025-07-20'
SELECT SUM(`jumlah_kg`) AS `jumlah_kg`
FROM `detail_transaksi`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'calon_mitra'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'mitra'

    public function adminSales()
    {
        $db = \Config\Database::connect();

        $stokMasuk  = $db->table('hasil_produksi')->selectSum('jumlah_kg')->get()->getRow()->jumlah_kg ?? 0;
        $stokKeluar = $db->table('detail_transaksi')->selectSum('jumlah_kg')->get()->getRow()->jumlah_kg ?? 0;
        $totalStokProduk = max(0, $stokMasuk - $stokKeluar);

        $calonMitra = $db->table('users')->where('role', 'calon_mitra')->countAllResults();
---
SELECT SUM(`jumlah_kg`) AS `jumlah_kg`
FROM `hasil_produksi`
SELECT SUM(`jumlah_kg`) AS `jumlah_kg`
FROM `detail_transaksi`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'mitra'