app/Models/DashboardModel.php

SELECT SUM(`total_harga`) AS `total`
FROM `transaksi`
WHERE `status_pembayaran` = 'dibayar'
AND YEAR(tanggal_transaksi) = '2025'
AND MONTH(tanggal_transaksi) = '07'
---
    public function getTotalPenjualanBulanIni()
    {
        $builder = $this->db->table($this->tableTransaksi);
        $builder->selectSum('total_harga', 'total');
        $builder->where('status_pembayaran', 'dibayar');
        $builder->where('YEAR(tanggal_transaksi)', date('Y'));
        $builder->where('MONTH(tanggal_transaksi)', date('m'));

        $result = $builder->get()->getRow();

SELECT COUNT(*) AS `numrows`
FROM `mitra`
WHERE `status_verifikasi` = 'diterima'
---
    public function getJumlahMitraAktif()
    {
        $builder = $this->db->table($this->tableMitra);
        $builder->where('status_verifikasi', 'diterima');
        return $builder->countAllResults();

SELECT SUM(`berat_total_kg`) AS `total_berat`
FROM `ayam_hidup`
---
    public function getTotalBeratAyamHidup()
    {
        $builder = $this->db->table($this->tableAyamHidup);
        $builder->selectSum('berat_total_kg', 'total_berat');
        $result = $builder->get()->getRow();

SELECT SUM(`jumlah_ekor`) AS `total_ekor`
FROM `ayam_hidup`
---
    public function getTotalEkorAyamHidup()
    {
        $builder = $this->db->table($this->tableAyamHidup);
        $builder->selectSum('jumlah_ekor', 'total_ekor');
        $result = $builder->get()->getRow();