app/Models/LaporanModel.php

SELECT `stok_log`.`id`, `stok_log`.`tanggal`, `produk`.`nama_produk`, `stok_log`.`tipe`, `stok_log`.`jumlah_kg`, `stok_log`.`keterangan`
FROM `stok_log`
LEFT JOIN `produk` ON `produk`.`id` = `stok_log`.`produk_id`
ORDER BY `stok_log`.`tanggal` DESC
---
    public function getLogPergerakanStok()
    {
        return $this->db->table('stok_log')
            ->select('
                stok_log.id,
                stok_log.tanggal,
                produk.nama_produk,
                stok_log.tipe,
                stok_log.jumlah_kg,
                stok_log.keterangan
            ')
            ->join('produk', 'produk.id = stok_log.produk_id', 'left')
            ->orderBy('stok_log.tanggal', 'DESC')
            ->get()
            ->getResultArray();